{
  "nodes": [
    {
      "op": "null", 
      "name": "input_ids", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "token_type_ids", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "attention_mask", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_take_cast_take_add_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "f455b43bbd8985a2", 
        "func_name": "tvmgen_default_fused_cast_take_cast_take_add_add"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_mean", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a39e9acd79e40a0", 
        "func_name": "tvmgen_default_fused_mean"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_variance", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "54853a83b943e656", 
        "func_name": "tvmgen_default_fused_variance"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "7801ea67baa4e1ed", 
        "func_name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a7e43535599f2bb", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "ad795f4e21bb9bfd", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b512j32k", 
        "flatten_data": "0", 
        "dst_layout": "120b4j1b2j1b1j1b1j32k1b1j1k1b64j", 
        "hash": "637ae471e83a1b85", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "3e2e2aac0fdfd9aa", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_expand_dims_expand_dims_cast_subtract_multiply", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "79baa946467b5dac", 
        "func_name": "tvmgen_default_fused_expand_dims_expand_dims_cast_subtract_multiply"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_divide_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "780202c7565ce062", 
        "func_name": "tvmgen_default_fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_softmax", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "5953a8554662de0a", 
        "func_name": "tvmgen_default_fused_nn_softmax"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "3bff7ddf1a740e03", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b32j512k", 
        "flatten_data": "0", 
        "dst_layout": "120b1j1b1j1b1j1b1j256k1b2j2k1b16j", 
        "hash": "344fdcd99929665b", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_1", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "f0d1f1073bf772b0", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul_1"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_transpose_reshape", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "8eef88d10e9edf30", 
        "func_name": "tvmgen_default_fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "hash": "fbe2feb551b83081", 
        "func_name": "tvmgen_default_fused_reshape_add_add"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_mean1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a39e9acd79e40a0", 
        "func_name": "tvmgen_default_fused_mean"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_variance1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "54853a83b943e656", 
        "func_name": "tvmgen_default_fused_variance"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "7801ea67baa4e1ed", 
        "func_name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a7e43535599f2bb", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "735c72c172e866b0", 
        "func_name": "tvmgen_default_fused_nn_dense_1"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_multiply_erf_multiply_add_multiply_reshape", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "93ed0e69ccfa81c1", 
        "func_name": "tvmgen_default_fused_reshape_add_multiply_erf_multiply_add_multiply_reshape"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "8493e510d1dd6b28", 
        "func_name": "tvmgen_default_fused_nn_dense_2"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_add1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "hash": "fbe2feb551b83081", 
        "func_name": "tvmgen_default_fused_reshape_add_add"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_mean2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a39e9acd79e40a0", 
        "func_name": "tvmgen_default_fused_mean"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_variance2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "54853a83b943e656", 
        "func_name": "tvmgen_default_fused_variance"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "7801ea67baa4e1ed", 
        "func_name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a7e43535599f2bb", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "ad795f4e21bb9bfd", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b512j32k", 
        "flatten_data": "0", 
        "dst_layout": "120b4j1b2j1b1j1b1j32k1b1j1k1b64j", 
        "hash": "637ae471e83a1b85", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "3e2e2aac0fdfd9aa", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul"
      }, 
      "inputs": [
        [
          59, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_divide_add1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "780202c7565ce062", 
        "func_name": "tvmgen_default_fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_softmax1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "5953a8554662de0a", 
        "func_name": "tvmgen_default_fused_nn_softmax"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "3bff7ddf1a740e03", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_11", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b32j512k", 
        "flatten_data": "0", 
        "dst_layout": "120b1j1b1j1b1j1b1j256k1b2j2k1b16j", 
        "hash": "344fdcd99929665b", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_1", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "f0d1f1073bf772b0", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul_1"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_transpose_reshape1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "8eef88d10e9edf30", 
        "func_name": "tvmgen_default_fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_add2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "hash": "fbe2feb551b83081", 
        "func_name": "tvmgen_default_fused_reshape_add_add"
      }, 
      "inputs": [
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_mean3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a39e9acd79e40a0", 
        "func_name": "tvmgen_default_fused_mean"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_variance3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "54853a83b943e656", 
        "func_name": "tvmgen_default_fused_variance"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "7801ea67baa4e1ed", 
        "func_name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a7e43535599f2bb", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "735c72c172e866b0", 
        "func_name": "tvmgen_default_fused_nn_dense_1"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_multiply_erf_multiply_add_multiply_reshape1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "93ed0e69ccfa81c1", 
        "func_name": "tvmgen_default_fused_reshape_add_multiply_erf_multiply_add_multiply_reshape"
      }, 
      "inputs": [
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "8493e510d1dd6b28", 
        "func_name": "tvmgen_default_fused_nn_dense_2"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_add3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "hash": "fbe2feb551b83081", 
        "func_name": "tvmgen_default_fused_reshape_add_add"
      }, 
      "inputs": [
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_mean4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a39e9acd79e40a0", 
        "func_name": "tvmgen_default_fused_mean"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_variance4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "54853a83b943e656", 
        "func_name": "tvmgen_default_fused_variance"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "7801ea67baa4e1ed", 
        "func_name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a7e43535599f2bb", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          98, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "ad795f4e21bb9bfd", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform2", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b512j32k", 
        "flatten_data": "0", 
        "dst_layout": "120b4j1b2j1b1j1b1j32k1b1j1k1b64j", 
        "hash": "637ae471e83a1b85", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "3e2e2aac0fdfd9aa", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul"
      }, 
      "inputs": [
        [
          101, 
          0, 
          0
        ], 
        [
          105, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_divide_add2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "780202c7565ce062", 
        "func_name": "tvmgen_default_fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_softmax2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "5953a8554662de0a", 
        "func_name": "tvmgen_default_fused_nn_softmax"
      }, 
      "inputs": [
        [
          107, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "3bff7ddf1a740e03", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_12", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b32j512k", 
        "flatten_data": "0", 
        "dst_layout": "120b1j1b1j1b1j1b1j256k1b2j2k1b16j", 
        "hash": "344fdcd99929665b", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_1", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "f0d1f1073bf772b0", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul_1"
      }, 
      "inputs": [
        [
          109, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_transpose_reshape2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "8eef88d10e9edf30", 
        "func_name": "tvmgen_default_fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          114, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_add4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "hash": "fbe2feb551b83081", 
        "func_name": "tvmgen_default_fused_reshape_add_add"
      }, 
      "inputs": [
        [
          117, 
          0, 
          0
        ], 
        [
          118, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_mean5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a39e9acd79e40a0", 
        "func_name": "tvmgen_default_fused_mean"
      }, 
      "inputs": [
        [
          119, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_variance5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "54853a83b943e656", 
        "func_name": "tvmgen_default_fused_variance"
      }, 
      "inputs": [
        [
          119, 
          0, 
          0
        ], 
        [
          120, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "7801ea67baa4e1ed", 
        "func_name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          119, 
          0, 
          0
        ], 
        [
          120, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ], 
        [
          122, 
          0, 
          0
        ], 
        [
          123, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a7e43535599f2bb", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          124, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "735c72c172e866b0", 
        "func_name": "tvmgen_default_fused_nn_dense_1"
      }, 
      "inputs": [
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_multiply_erf_multiply_add_multiply_reshape2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "93ed0e69ccfa81c1", 
        "func_name": "tvmgen_default_fused_reshape_add_multiply_erf_multiply_add_multiply_reshape"
      }, 
      "inputs": [
        [
          127, 
          0, 
          0
        ], 
        [
          128, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense_22", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "8493e510d1dd6b28", 
        "func_name": "tvmgen_default_fused_nn_dense_2"
      }, 
      "inputs": [
        [
          129, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_add5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "hash": "fbe2feb551b83081", 
        "func_name": "tvmgen_default_fused_reshape_add_add"
      }, 
      "inputs": [
        [
          131, 
          0, 
          0
        ], 
        [
          132, 
          0, 
          0
        ], 
        [
          124, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_mean6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a39e9acd79e40a0", 
        "func_name": "tvmgen_default_fused_mean"
      }, 
      "inputs": [
        [
          133, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_variance6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "54853a83b943e656", 
        "func_name": "tvmgen_default_fused_variance"
      }, 
      "inputs": [
        [
          133, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "hash": "7801ea67baa4e1ed", 
        "func_name": "tvmgen_default_fused_subtract_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          133, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ], 
        [
          136, 
          0, 
          0
        ], 
        [
          137, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0a7e43535599f2bb", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          138, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          139, 
          0, 
          0
        ], 
        [
          140, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "ad795f4e21bb9bfd", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          141, 
          0, 
          0
        ], 
        [
          142, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          139, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform3", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b512j32k", 
        "flatten_data": "0", 
        "dst_layout": "120b4j1b2j1b1j1b1j32k1b1j1k1b64j", 
        "hash": "637ae471e83a1b85", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          145, 
          0, 
          0
        ], 
        [
          146, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "3e2e2aac0fdfd9aa", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul"
      }, 
      "inputs": [
        [
          143, 
          0, 
          0
        ], 
        [
          147, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_divide_add3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "780202c7565ce062", 
        "func_name": "tvmgen_default_fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          148, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_softmax3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "5953a8554662de0a", 
        "func_name": "tvmgen_default_fused_nn_softmax"
      }, 
      "inputs": [
        [
          149, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "3bff7ddf1a740e03", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          150, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_dense14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9fd477d28aa62e16", 
        "func_name": "tvmgen_default_fused_nn_dense"
      }, 
      "inputs": [
        [
          139, 
          0, 
          0
        ], 
        [
          152, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_13", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "120b32j512k", 
        "flatten_data": "0", 
        "dst_layout": "120b1j1b1j1b1j1b1j256k1b2j2k1b16j", 
        "hash": "344fdcd99929665b", 
        "func_name": "tvmgen_default_fused_reshape_add_reshape_transpose_reshape_auto_scheduler_layout_transform_1", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          153, 
          0, 
          0
        ], 
        [
          154, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_matmul_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "f0d1f1073bf772b0", 
        "func_name": "tvmgen_default_fused_nn_batch_matmul_1"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_transpose_reshape3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "8eef88d10e9edf30", 
        "func_name": "tvmgen_default_fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          156, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
